# Define corpus with each entry as a tuple of (sentence, label)
seat_viewing_datasets = [
    ("ငါကြည့်ချင်တယ်", 1),  
    ("မကြည့်ချင်ဘူး။", 0),  
    ("ငါဒီပစ္စည်းကိုဝယ်ချင်တယ်။", 1)   ,
    ("ထိုင်ခုံအစီအစဥ်ကြည့်မယ်။", 1)   ,
    ("အခြားလမ်းကြောင်းရှိနိုင်ပါသလား။", 0)   ,
    ("ငါနည်းနည်းကြည့်မယ်။", 1)   ,
    ("ငါရွေးချယ်ခွင့်ရှိနိုင်မလား။", 1)   ,
    ("ငါရွေးမယ်။", 1)   ,
    ("ပိုကောင်းတဲ့ထိုင်ခုံရချင်တယ်။", 1)   ,
    ("မယူချင်ဘူး။",  0)   ,
    ("ငါဒီပစ္စည်းကိုမဝယ်ချင်တယ်။", 0)   ,
    ("မကြိုက်ဘူး။", 0)   ,
    ("ဈေးကြီးတယ်။", 0 )   ,
    ("သိပ်မဆိုးပါဘူး။", 1)   ,
    ("Yes", 1)   ,
    ("Okay", 1)   ,
    ("ငါ စိတ်မဝင်စားဘူး။" , 0) ,
    ("No", 0)
]

